tutorialsDyM/FallingSphereSuspensionMorphing3D/0_org/p_rbgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;


boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        type            overset;
    }

    sphere
    {
    
  //      type            fixedFluxPressure;
    //    gradient        $internalField;
    type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
       type            zeroGradient;
    }

    top
    {
        type            fixedValue;
        value           uniform 0;    }
    Bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;

    }
    atmosphere
    {
//        type            zeroGradient;
        type            fixedValue;
        value           uniform 0;    
    }
}

// ************************************************************************* //
