tutorialsDyM/FallingSphereSuspensionMorphing3D/0_org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (10 0 0);
pressure             0;
turbulentKE          1.5;
turbulentEpsilon     0.88;

// ************************************************************************* //
